# Nurbs Surface Data Methods

Source: https://www.revitapidocs.com/2026/91378612-4fb8-12a4-04ef-76dc9b573dd9.htm

---

| Nurbs Surface Data Methods |
| --- |

The NurbsSurfaceData type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetControlPoint | Get the list of control points. |
|  | GetControlPoints | Get the list of control points. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetKnotsU | Get the list of knots in the u\-direction. |
|  | GetKnotsV | Get the list of knots in the v\-direction. |
|  | GetKnotU | Get the knot in the u\-direction. |
|  | GetKnotV | Get the knot in the v\-direction. |
|  | GetNumberOfControlPoints | Get the number of control points. |
|  | GetNumberOfKnotsU | Get the number of knots in the u\-direction. |
|  | GetNumberOfKnotsV | Get the number of knots in the v\-direction. |
|  | GetNumberOfWeights | Get the number of weights. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | GetWeight | Get the weight. |
|  | GetWeights | Get the list of weights. |
|  | IsValid | Check if the object contains a valid NurbsSurfaceData. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace